In [2]:
import pandas as pd

In [4]:
dict1 = {"Name": ["Alex", "Bolu", "Mike", "Taiwo", "Dami", "Kasi",
                "Sarah"],
                "Marks": [89, 93, 93, 20, 10, 40, 10],
                "Gender": ["Male", "Male", "Male", "Female", "Female", "Male", "Female",]
                }

df1 = pd.DataFrame(dict1)
df1

    Name  Marks  Gender
0   Alex     89    Male
1   Bolu     93    Male
2   Mike     93    Male
3  Taiwo     20  Female
4   Dami     10  Female
5   Kasi     40    Male
6  Sarah     10  Female

## Display Top 3 Rows of the Dataset

In [8]:
df1.head(3)

   Name  Marks Gender
0  Alex     89   Male
1  Bolu     93   Male
2  Mike     93   Male

## Check Last 3 Rows of the Dataset

In [10]:
df1.tail(3)

    Name  Marks  Gender
4   Dami     10  Female
5   Kasi     40    Male
6  Sarah     10  Female

## Find the shape of our Dataset (Number of Rows and Number of Columns)

In [11]:
df1.shape

(7, 3)

In [13]:
print("Number of Rows", df1.shape[0])
print("Number of Columns", df1.shape[1])

Number of Rows 7
Number of Columns 3

## Get information about our Dataset like Total Number of Rows, Total Number of Columns, Datatypes of Each Column and Memory Requirement.

In [14]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 300.0+ bytes

## Check Null Values in the Dataset

In [20]:
df1.isnull().sum(axis=0)

Name      0
Marks     0
Gender    0
dtype: int64

## Get Overall Statistics About The Dataframe

In [22]:
df1.describe(include="all")

        Name      Marks Gender
count      7   7.000000      7
unique     7        NaN      2
top     Alex        NaN   Male
freq       1        NaN      4
mean     NaN  50.714286    NaN
std      NaN  39.613610    NaN
min      NaN  10.000000    NaN
25%      NaN  15.000000    NaN
50%      NaN  40.000000    NaN
75%      NaN  91.000000    NaN
max      NaN  93.000000    NaN

## Find Unique Values From The Gender Column

In [23]:
df1

    Name  Marks  Gender
0   Alex     89    Male
1   Bolu     93    Male
2   Mike     93    Male
3  Taiwo     20  Female
4   Dami     10  Female
5   Kasi     40    Male
6  Sarah     10  Female

In [25]:
df1['Gender'].unique()

array(['Male', 'Female'], dtype=object)

## Find the Number of Unique values from the Gender column

In [26]:
df1['Gender'].nunique()

2

## Display Count of Unique Values in Gender Column

In [27]:
df1['Gender'].value_counts()

Gender
Male      4
Female    3
Name: count, dtype: int64

## Find the Total Number of Students Having Marks between 50 to 100 (inclusive) using between Method.

In [31]:
df1[df1['Marks']>=50]

   Name  Marks Gender
0  Alex     89   Male
1  Bolu     93   Male
2  Mike     93   Male

In [35]:
len(df1[(df1['Marks']>=50) & (df1['Marks']<=100)])

3

In [37]:
sum(df1['Marks'].between(50, 100))

3

## Find Average Marks

In [38]:
df1

    Name  Marks  Gender
0   Alex     89    Male
1   Bolu     93    Male
2   Mike     93    Male
3  Taiwo     20  Female
4   Dami     10  Female
5   Kasi     40    Male
6  Sarah     10  Female

In [42]:
df1['Marks'].mean()

np.float64(50.714285714285715)

## Apply Method

In [51]:
def marks(x):
    return x//2

In [49]:
df1['Half_marks']=df1['Marks'].apply(marks)

In [52]:
df1

    Name  Marks  Gender  Half_marks
0   Alex     89    Male          44
1   Bolu     93    Male          46
2   Mike     93    Male          46
3  Taiwo     20  Female          10
4   Dami     10  Female           5
5   Kasi     40    Male          20
6  Sarah     10  Female           5

In [53]:
df1['Marks'].apply(lambda x:x/2)

0    44.5
1    46.5
2    46.5
3    10.0
4     5.0
5    20.0
6     5.0
Name: Marks, dtype: float64

In [54]:
df1['Name'].apply(len)

0    4
1    4
2    4
3    5
4    4
5    4
6    5
Name: Name, dtype: int64

## Map Function.

In [55]:
df1

    Name  Marks  Gender  Half_marks
0   Alex     89    Male          44
1   Bolu     93    Male          46
2   Mike     93    Male          46
3  Taiwo     20  Female          10
4   Dami     10  Female           5
5   Kasi     40    Male          20
6  Sarah     10  Female           5

In [57]:
df1['Male_Female']=df1['Gender'].map({'Male': 1, 'Female': 0})

In [58]:
df1

    Name  Marks  Gender  Half_marks  Male_Female
0   Alex     89    Male          44            1
1   Bolu     93    Male          46            1
2   Mike     93    Male          46            1
3  Taiwo     20  Female          10            0
4   Dami     10  Female           5            0
5   Kasi     40    Male          20            1
6  Sarah     10  Female           5            0

## Drop the column(s)

In [59]:
df1

    Name  Marks  Gender  Half_marks  Male_Female
0   Alex     89    Male          44            1
1   Bolu     93    Male          46            1
2   Mike     93    Male          46            1
3  Taiwo     20  Female          10            0
4   Dami     10  Female           5            0
5   Kasi     40    Male          20            1
6  Sarah     10  Female           5            0

In [ ]:
df1.drop('Male_Female', axis=1)

    Name  Marks  Gender  Half_marks
0   Alex     89    Male          44
1   Bolu     93    Male          46
2   Mike     93    Male          46
3  Taiwo     20  Female          10
4   Dami     10  Female           5
5   Kasi     40    Male          20
6  Sarah     10  Female           5

In [62]:
df1.drop(['Male_Female', 'Half_marks'] , axis=1, inplace=True)

In [63]:
df1

    Name  Marks  Gender
0   Alex     89    Male
1   Bolu     93    Male
2   Mike     93    Male
3  Taiwo     20  Female
4   Dami     10  Female
5   Kasi     40    Male
6  Sarah     10  Female

## Print Name of Columns

In [64]:
df1.columns

Index(['Name', 'Marks', 'Gender'], dtype='object')

In [65]:
df1.index

RangeIndex(start=0, stop=7, step=1)

## Sort the Dataframe As Per The Marks Column

In [66]:
df1

    Name  Marks  Gender
0   Alex     89    Male
1   Bolu     93    Male
2   Mike     93    Male
3  Taiwo     20  Female
4   Dami     10  Female
5   Kasi     40    Male
6  Sarah     10  Female

In [69]:
df1.sort_values(by=['Marks', 'Gender'], ascending=False)

    Name  Marks  Gender
1   Bolu     93    Male
2   Mike     93    Male
0   Alex     89    Male
5   Kasi     40    Male
3  Taiwo     20  Female
4   Dami     10  Female
6  Sarah     10  Female

## Display Name & Marks of the Female Students

In [70]:
df1

    Name  Marks  Gender
0   Alex     89    Male
1   Bolu     93    Male
2   Mike     93    Male
3  Taiwo     20  Female
4   Dami     10  Female
5   Kasi     40    Male
6  Sarah     10  Female

In [74]:
df1[df1['Gender']=='Female'][['Name','Marks']]

    Name  Marks
3  Taiwo     20
4   Dami     10
6  Sarah     10

In [77]:
df1[df1['Gender'].isin(['Female'])][['Name','Marks']]

    Name  Marks
3  Taiwo     20
4   Dami     10
6  Sarah     10